Terraform apply initially failed with the following error:

```
Error: reading CloudTrail Trail (arn:aws:cloudtrail:us-east-1:533266992459:trail/main-dev): operation error CloudTrail: DescribeTrails, https response error StatusCode: 400, RequestID: 069a20a9-db35-4710-82d0-01c9306f1873, InvalidTrailNameException: Trail ARN is not valid: arn:aws:cloudtrail:us-east-1:533266992459:trail/main-dev. Account number does not match caller's account.
```

Afterward, the Terraform plan showed the CloudTrail resource as being tainted and in need of replacement:

```
Terraform will perform the following actions:

  # module.sec_resources.aws_cloudtrail.main is tainted, so must be replaced
-/+ resource "aws_cloudtrail" "main" {
      ~ arn                           = "arn:aws:cloudtrail:us-east-1:533266992459:trail/main-dev" -> (known after apply)
      ~ home_region                   = "us-east-1" -> (known after apply)
      ~ id                            = "arn:aws:cloudtrail:us-east-1:533266992459:trail/main-dev" -> (known after apply)
        name                          = "main-dev"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

The trail was successfully recreated upon running `terraform apply` a second time.

I suspect this error has to do with the org trail being owned by the management account, despite it being created from the security account, but I'm not sure yet why it successfully created the second time. More research required.